let math = +prompt('Скільки буде 2+2?', 'Перевірка на 1-ий клас');
let sun = prompt('Сонце встає на сході?', 'Перевірка на орієнтацію у просторі');
let err = prompt('Скільки буде 5 / 0?', 'Перевірка на дибіла');
let sky = prompt('Якого кольору небо?', 'Перевірка на вміння дивитися вгору');
let autostop = prompt('Яка правильна відповідь на головне питання життя, всесвіту та всього такого?', 'Перевірка на прочитання найкращої книги у світі');
let res = 0;

if(math == 4) {
    res += 10;
} else {
    res = 0;
}

if(sun == 'так') {
    res += 10;
} else {
    res += 0;
}

if(err == 'ніскільки') {
    res += 10;
} else {
    res += 0;
}

if(sky == "блакитного") {
    res += 10;
} else {
    res += 0;
}

if(autostop == 42) {
    res += 10;
} else {
    res += 0;
}

alert(`Ваш результат: ${res}`);